zion999-cmd/crosslegcheck/cubeide/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
      if ((phost->device.is_connected) != 0U)
      {
        USBH_UsrLog("USB Device Connected");

        /* Wait for 200 ms after connection */
        phost->gState = HOST_DEV_WAIT_FOR_ATTACHMENT;
        USBH_Delay(200U);
        (void)USBH_LL_ResetPort(phost);

        /* Make sure to start with Default address */
        phost->device.address = USBH_ADDRESS_DEFAULT;
        phost->Timeout = 0U;

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
      break;

    case HOST_DEV_WAIT_FOR_ATTACHMENT: /* Wait for Port Enabled */

      if (phost->device.PortEnabled == 1U)
      {
        USBH_UsrLog("USB Device Reset Completed");
        phost->device.RstCnt = 0U;
        phost->gState = HOST_DEV_ATTACHED;
      }
      else
      {
        if (phost->Timeout > USBH_DEV_RESET_TIMEOUT)
        {
          phost->device.RstCnt++;
          if (phost->device.RstCnt > 3U)
          {
            /* Buggy Device can't complete reset */
            USBH_UsrLog("USB Reset Failed, Please unplug the Device.");
            phost->gState = HOST_ABORT_STATE;
          }
          else
          {
            phost->gState = HOST_IDLE;
          }
        }
        else
        {
          phost->Timeout += 10U;
          USBH_Delay(10U);
        }
      }

#if (USBH_USE_OS == 1U)
      USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      break;

    case HOST_DEV_ATTACHED :

      if (phost->pUser != NULL)
      {
        phost->pUser(phost, HOST_USER_CONNECTION);
      }

      /* Wait for 100 ms after Reset */
      USBH_Delay(100U);

      phost->device.speed = (uint8_t)USBH_LL_GetSpeed(phost);

#if defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U)
      phost->NakTimeout = USBH_NAK_SOF_COUNT;
#endif /* defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U) */

      phost->gState = HOST_ENUMERATION;

      phost->Control.pipe_out = USBH_AllocPipe(phost, 0x00U);
      phost->Control.pipe_in  = USBH_AllocPipe(phost, 0x80U);

      /* Open Control pipes */
      (void)USBH_OpenPipe(phost, phost->Control.pipe_in, 0x80U,
                          phost->device.address, phost->device.speed,
                          USBH_EP_CONTROL, (uint16_t)phost->Control.pipe_size);

      /* Open Control pipes */
      (void)USBH_OpenPipe(phost, phost->Control.pipe_out, 0x00U,
                          phost->device.address, phost->device.speed,
                          USBH_EP_CONTROL, (uint16_t)phost->Control.pipe_size);

#if (USBH_USE_OS == 1U)
      USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      break;

    case HOST_ENUMERATION:
      /* Check for enumeration status */
      status = USBH_HandleEnum(phost);
      if (status == USBH_OK)
      {
        /* The function shall return USBH_OK when full enumeration is complete */
        USBH_UsrLog("Enumeration done.");

        phost->device.current_interface = 0U;

        if (phost->device.DevDesc.bNumConfigurations == 1U)
        {
          USBH_UsrLog("This device has only 1 configuration.");
          phost->gState = HOST_SET_CONFIGURATION;
        }
        else
        {
          phost->gState = HOST_INPUT;
        }

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_STATE_CHANGED_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
      break;

    case HOST_INPUT:
    {
      /* user callback for end of device basic enumeration */
      if (phost->pUser != NULL)
      {
        phost->pUser(phost, HOST_USER_SELECT_CONFIGURATION);
        phost->gState = HOST_SET_CONFIGURATION;

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_STATE_CHANGED_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
    }
    break;

    case HOST_SET_CONFIGURATION:
      /* set configuration */
      if (USBH_SetCfg(phost, (uint16_t)phost->device.CfgDesc.bConfigurationValue) == USBH_OK)
      {
        phost->gState = HOST_SET_WAKEUP_FEATURE;
        USBH_UsrLog("Default configuration set.");
      }

#if (USBH_USE_OS == 1U)
      USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      break;

    case  HOST_SET_WAKEUP_FEATURE:

      if (((phost->device.CfgDesc.bmAttributes) & (1U << 5)) != 0U)
      {
        status = USBH_SetFeature(phost, FEATURE_SELECTOR_REMOTEWAKEUP);

        if (status == USBH_OK)
        {
          USBH_UsrLog("Device remote wakeup enabled");
          phost->gState = HOST_CHECK_CLASS;
        }
        else if (status == USBH_NOT_SUPPORTED)
        {
          USBH_UsrLog("Remote wakeup not supported by the device");
          phost->gState = HOST_CHECK_CLASS;
        }
        else
        {
          /* .. */
        }
      }
      else
      {
        phost->gState = HOST_CHECK_CLASS;
      }

#if (USBH_USE_OS == 1U)
      USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      break;

    case HOST_CHECK_CLASS:

      if (phost->ClassNumber == 0U)
      {
        USBH_UsrLog("No Class has been registered.");
      }
      else
      {
        phost->pActiveClass = NULL;

        for (idx = 0U; idx < USBH_MAX_NUM_SUPPORTED_CLASS; idx++)
        {
          if (phost->pClass[idx]->ClassCode == phost->device.CfgDesc.Itf_Desc[0].bInterfaceClass)
          {
            phost->pActiveClass = phost->pClass[idx];
            break;
          }
        }

        if (phost->pActiveClass != NULL)
        {
          if (phost->pActiveClass->Init(phost) == USBH_OK)
          {
            phost->gState = HOST_CLASS_REQUEST;
            USBH_UsrLog("%s class started.", phost->pActiveClass->Name);

            /* Inform user that a class has been activated */
            phost->pUser(phost, HOST_USER_CLASS_SELECTED);
          }
          else
          {
            phost->gState = HOST_ABORT_STATE;
              USBH_UsrLog("Device not supporting %s class.", phost->pActiveClass->Name);
              /* Extra debug: print the interface descriptor that led to selection
               * and the pointer to the active class so we can more easily see
               * why Init() returned failure.
               */
              USBH_DbgLog("Class Init failed for %s; iface0 Class=0x%02X Sub=0x%02X Prot=0x%02X",
                          phost->pActiveClass->Name,
                          phost->device.CfgDesc.Itf_Desc[0].bInterfaceClass,
                          phost->device.CfgDesc.Itf_Desc[0].bInterfaceSubClass,
                          phost->device.CfgDesc.Itf_Desc[0].bInterfaceProtocol);
          }
        }
        else
        {
          /* No class matched by bInterfaceClass. Provide verbose diagnostics
           * and optionally try endpoint-based fallback to detect CDC-like
           * devices that report vendor-specific class.
           */
          USBH_UsrLog("No class matched by bInterfaceClass; dumping interface info...");
          {
            uint8_t if_i, ep_i;
            USBH_UsrLog("Device reports %d interfaces", phost->device.CfgDesc.bNumInterfaces);
            for (if_i = 0U; if_i < phost->device.CfgDesc.bNumInterfaces; if_i++)
            {
              USBH_InterfaceDescTypeDef *pif = &phost->device.CfgDesc.Itf_Desc[if_i];
              USBH_UsrLog("Interface %d: Class=0x%02X SubClass=0x%02X Protocol=0x%02X NumEp=%d iInterface=%d",
                          if_i, pif->bInterfaceClass, pif->bInterfaceSubClass, pif->bInterfaceProtocol, pif->bNumEndpoints, pif->iInterface);
              for (ep_i = 0U; ep_i < pif->bNumEndpoints; ep_i++)
              {
                USBH_EpDescTypeDef *pep = &pif->Ep_Desc[ep_i];
#if (USBH_DEBUG_LEVEL > 0U)
                uint8_t ep_dir = (pep->bEndpointAddress & USB_EP_DIR_IN) ? 1U : 0U;
                uint8_t ep_type = pep->bmAttributes & 0x03U;
                const char *tstr = (ep_type == USB_EP_TYPE_INTR) ? "INTR" : ((ep_type == USB_EP_TYPE_BULK) ? "BULK" : ((ep_type == USB_EP_TYPE_ISOC) ? "ISOC" : "CTRL"));
                USBH_UsrLog("  Ep %d: Addr=0x%02X Dir=%s Type=%s MaxPkt=%d Interval=%d",
                            ep_i, pep->bEndpointAddress, ep_dir ? "IN" : "OUT", tstr, pep->wMaxPacketSize, pep->bInterval);
#else
                (void)pep;
#endif
              }
            }
          }

#if defined(USBH_FORCE_CDC_BY_ENDPOINT) && (USBH_FORCE_CDC_BY_ENDPOINT == 1U)
          USBH_UsrLog("USBH_FORCE_CDC_BY_ENDPOINT enabled: checking endpoint patterns for CDC-like interface...");
          {
            uint8_t if_i, ep_ix;
            for (if_i = 0U; if_i < phost->device.CfgDesc.bNumInterfaces; if_i++)
            {
              USBH_InterfaceDescTypeDef *pif = &phost->device.CfgDesc.Itf_Desc[if_i];
              uint8_t has_int_in = 0U, has_bulk_in = 0U, has_bulk_out = 0U;
              for (ep_ix = 0U; ep_ix < pif->bNumEndpoints; ep_ix++)
              {
                USBH_EpDescTypeDef *pep = &pif->Ep_Desc[ep_ix];
                uint8_t ep_dir = (pep->bEndpointAddress & USB_EP_DIR_IN) ? 1U : 0U;
                uint8_t ep_type = pep->bmAttributes & 0x03U; /* mask transfer type */

                if ((ep_type == USB_EP_TYPE_INTR) && (ep_dir == 1U))
                {
                  has_int_in = 1U;
                }
                else if ((ep_type == USB_EP_TYPE_BULK) && (ep_dir == 1U))
                {
                  has_bulk_in = 1U;
                }
                else if ((ep_type == USB_EP_TYPE_BULK) && (ep_dir == 0U))
                {
                  has_bulk_out = 1U;
                }
              }

              USBH_UsrLog("Interface %d endpoint pattern: INT_IN=%d BULK_IN=%d BULK_OUT=%d", if_i, has_int_in, has_bulk_in, has_bulk_out);

              if (has_int_in && has_bulk_in && has_bulk_out)
              {
                /* locate registered CDC class (class code 0x02) */
                uint8_t j;
                for (j = 0U; j < USBH_MAX_NUM_SUPPORTED_CLASS; j++)
                {
                  if (phost->pClass[j]->ClassCode == 0x02U)
                  {
                    phost->pActiveClass = phost->pClass[j];
                    USBH_UsrLog("Endpoint pattern matches CDC on interface %d; forcing use of %s class.", if_i, phost->pActiveClass->Name);
                    break;
                  }
                }
                if (phost->pActiveClass != NULL)
                {
                  break; /* found one, stop searching interfaces */
                }
              }
            }
          }
#endif /* USBH_FORCE_CDC_BY_ENDPOINT */

          if (phost->pActiveClass == NULL)
          {
            phost->gState = HOST_ABORT_STATE;
            USBH_UsrLog("No registered class for this device.");
          }
        }
      }

#if (USBH_USE_OS == 1U)
      USBH_OS_PutMessage(phost, USBH_STATE_CHANGED_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      break;

    case HOST_CLASS_REQUEST:
      /* process class standard control requests state machine */
      if (phost->pActiveClass != NULL)
      {
        status = phost->pActiveClass->Requests(phost);

